app/Controllers/Auth.php

    public function processRegister()
    {
        helper(['form']);

        $rules = [
            'username'     => 'required|min_length[3]|max_length[50]|is_unique[users.username]',
            'email'        => 'required|valid_email|is_unique[users.email]',
            'password'     => 'required|min_length[6]',
            'pass_confirm' => 'matches[password]',
        ];

        if (! $this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $userModel = new UserModel();

        $userModel->save([
            'username' => $this->request->getPost('username'),
            'email'    => $this->request->getPost('email'),
            'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
        ]);
---
INSERT INTO `users` (`username`, `email`, `password`) VALUES ('talal1', 'tahme228@gmail.com', '$2y$10$ebuDU5ob81gLk3CLpb2j8ewYsHDJj1YXfV9aGyqHfbPTDmazqgecG')

public function processLogin()
{
    helper(['form']);

    $rules = [
        'email'    => 'required|valid_email',
        'password' => 'required',
    ];

    if (! $this->validate($rules)) {
        return redirect()->back()->withInput()->with('error', 'Please provide a valid email and password.');
    }

    $userModel = new UserModel();
    $user = $userModel->where('email', $this->request->getPost('email'))->first();
---
SELECT *
FROM `users`
WHERE `email` = 'tahme228@gmail.com'
 LIMIT 1