app/Controllers/Dashboard.php

    public function index()
    {
if (! session()->has('user_id')) {
        return redirect()->to('login');

    }

    $blogModel = new BlogModel();
    $blogs = $blogModel->findAll();
---
SELECT *
FROM `blogs`